Repository: amaarrjith/instaresolv-kmp-shared
Catalog: iosApp/iosApp/Localizable.xcstrings
Source language: en
Languages: ar, es, hi, ur

# topic_of_discussion_question_changed
source: ⚠️ The questions or contents in this topic of discussion have been updated. Please discard the draft
ar: ⚠️ تم تحديث الأسئلة أو المحتويات الموجودة في موضوع المناقشة هذا. يرجى تجاهل المسودة
es: ⚠️ Se han actualizado las preguntas o contenidos de este tema de discusión. Por favor descarta el borrador.
hi: ⚠️ चर्चा के इस विषय के प्रश्न या सामग्री अद्यतन कर दी गई है। कृपया ड्राफ्ट को त्यागें
ur: ⚠️ بحث کے اس موضوع میں سوالات یا مواد کو اپ ڈیٹ کر دیا گیا ہے۔ براہ کرم مسودہ کو مسترد کر دیں۔

source: TOPICS OF DISCUSSION
ar: موضوعات المناقشة
es: TEMAS DE DISCUSIÓN
hi: चर्चा के विषय
ur: بحث کے موضوعات

source: Training
ar: التدريب
es: Entrenamiento
hi: प्रशिक्षण
ur: ٹریننگ

source: Training Progress
ar: تقدم التدريب
es: Progreso del entrenamiento
hi: प्रशिक्षण प्रगति
ur: تربیتی پیش رفت

# training_with_icon
source: Training >
ar: التدريب >
es: Entrenamiento >
hi: प्रशिक्षण >
ur: ٹریننگ >

# training.detail.certificate
source: Certificate
ar: الشهادة
es: Certificado
hi: प्रमाणपत्र
ur: سرٹیفکیٹ

# training.detail.certificate_download_hint
source: Training completed. Download your certificate now
ar: اكتمل التدريب. قم بتنزيل شهادتك الآن
es: Capacitación completada. Descarga tu certificado ahora
hi: प्रशिक्षण पूरा हो गया। अपना प्रमाणपत्र अभी डाउनलोड करें
ur: ٹریننگ مکمل ہو گئی۔ اپنا سرٹیفکیٹ ابھی ڈاؤن لوڈ کریں

# training.detail.download_certificate
source: Download Certificate
ar: تنزيل الشهادة
es: Descargar certificado
hi: प्रमाणपत्र डाउनलोड करें
ur: سرٹیفکیٹ ڈاؤن لوڈ کریں

# training.detail.download_lesson_material
source: Download Lesson Material
ar: تنزيل مواد الدرس
es: Descargar material de la lección
hi: पाठ सामग्री डाउनलोड करें
ur: سبق کا مواد ڈاؤن لوڈ کریں

# training.detail.pdf_notes_references
source: PDF notes and references
ar: ملاحظات ومراجع PDF
es: Notas y referencias en PDF
hi: PDF नोट्स और संदर्भ
ur: PDF نوٹس اور حوالہ جات

# training.detail.quiz_section
source: Quiz Section
ar: قسم الاختبار
es: Sección del cuestionario
hi: क्विज़ अनुभाग
ur: کوئز سیکشن

# training.detail.start_quiz
source: Start Quiz
ar: بدء الاختبار
es: Iniciar cuestionario
hi: क्विज़ शुरू करें
ur: کوئز شروع کریں

# training.detail.unlock_quiz_hint
source: Watch Full video to unlock quiz section
ar: شاهد الفيديو بالكامل لفتح قسم الاختبار
es: Mira el video completo para desbloquear la sección del cuestionario
hi: क्विज़ अनुभाग अनलॉक करने के लिए पूरा वीडियो देखें
ur: کوئز سیکشن کو غیر مقفل کرنے کے لیے مکمل ویڈیو دیکھیں

# training.status.completed
source: COMPLETED
ar: مكتمل
es: COMPLETADO
hi: पूरा हुआ
ur: مکمل

# training.status.in_progress
source: IN PROGRESS
ar: قيد التنفيذ
es: EN PROGRESO
hi: प्रगति में
ur: جاری ہے

# training.status.not_started
source: NOT STARTED
ar: لم يبدأ
es: NO INICIADO
hi: शुरू नहीं हुआ
ur: شروع نہیں ہوا

# training.status.passed
source: PASSED
ar: تم الاجتياز
es: APROBADO
hi: उत्तीर्ण
ur: کامیاب

# transfer_admin_subtitle
source: Hand over admin rights to a project member.
ar: تسليم حقوق المسؤول إلى أحد أعضاء المشروع.
es: Entregue los derechos de administrador a un miembro del proyecto.
hi: किसी प्रोजेक्ट सदस्य को व्यवस्थापक अधिकार सौंपें।
ur: ایڈمن کے حقوق پروجیکٹ ممبر کے حوالے کریں۔

# transfer_admin_title
source: Transfer Admin Rights
ar: نقل حقوق المسؤول
es: Transferir derechos de administrador
hi: व्यवस्थापक अधिकार स्थानांतरित करें
ur: ایڈمن رائٹس کو منتقل کریں۔

source: Translate
ar: ترجمة
es: Traducir
hi: अनुवाद
ur: ترجمہ کریں

source: Translation Language
ar: لغة الترجمة
es: Idioma de traducción
hi: अनुवाद भाषा
ur: ترجمہ کی زبان

source: Try Again
ar: حاول ثانية
es: Intentar otra vez
hi: पुनः प्रयास करें
ur: دوبارہ کوشش کریں۔

source: Unique Code:
ar: الرمز الفريد:
es: Código único:
hi: यूनिक कोड:
ur: منفرد کوڈ:

source: Unknown
ar: غير معروف
es: Desconocido
hi: अज्ञात
ur: نامعلوم

# update_company_details_error
source: We couldn’t update your company details. Please log out and log in again
ar: لم نتمكن من تحديث تفاصيل شركتك. الرجاء تسجيل الخروج وتسجيل الدخول مرة أخرى
es: No pudimos actualizar los detalles de su empresa. Por favor cierre sesión e inicie sesión nuevamente
hi: हम आपकी कंपनी का विवरण अपडेट नहीं कर सके. कृपया लॉग आउट करें और दोबारा लॉग इन करें
ur: ہم آپ کی کمپنی کی تفصیلات کو اپ ڈیٹ نہیں کر سکے۔ براہ کرم لاگ آؤٹ کریں اور دوبارہ لاگ ان کریں۔

source: UPLOAD
ar: رفع
es: SUBIR
hi: अपलोड करें
ur: اپ لوڈ کریں۔

source: UPLOAD IMAGES
ar: رفع الصور
es: SUBIR IMÁGENES
hi: छवियाँ अपलोड करें
ur: امیجز اپ لوڈ کریں۔

source: Upload Sign
ar: تحميل التوقيع
es: Subir firma
hi: हस्ताक्षर अपलोड करें
ur: دستخط اپلوڈ کریں

source: URL Address
ar: عنوان URL
es: Dirección URL
hi: यूआरएल पता
ur: URL ایڈریس

source: User
ar: مستخدم
es: Usuario
hi: उपयोगकर्ता
ur: صارف

source: USER LIST
ar: قائمة المستخدمين
es: LISTA DE USUARIOS
hi: उपयोगकर्ता सूची
ur: صارف کی فہرست

# user_role_changed
source: Your Access Role Has Been Updated
ar: تم تحديث دور الوصول الخاص بك
es: Tu rol de acceso ha sido actualizado
hi: आपकी एक्सेस भूमिका अपडेट कर दी गई है
ur: آپ کا رسائی کردار اپ ڈیٹ کر دیا گیا ہے

# user_role_changed_description
source: Your account role has been changed. Please log in again to continue using the app with your updated access permissions.
ar: تم تغيير دور حسابك. يرجى تسجيل الدخول مرة أخرى لمتابعة استخدام التطبيق بصلاحياتك المحدثة.
es: El rol de tu cuenta ha cambiado. Por favor, inicia sesión nuevamente para continuar usando la aplicación con tus permisos actualizados.
hi: आपकी खाता भूमिका बदल दी गई है। अपडेट की गई एक्सेस अनुमतियों के साथ ऐप का उपयोग जारी रखने के लिए कृपया फिर से लॉग इन करें।
ur: آپ کے اکاؤنٹ کا کردار تبدیل کر دیا گیا ہے۔ اپ ڈیٹ شدہ رسائی اجازتوں کے ساتھ ایپ استعمال جاری رکھنے کے لیے براہ کرم دوبارہ لاگ ان کریں۔

# USERNAME_INVALID_CHARACTERS
source: Invalid username — should not contain spaces, numbers or special characters.
ar: اسم المستخدم غير صالح — يجب ألا يحتوي على مسافات أو أرقام أو أحرف خاصة.
es: Nombre de usuario no válido: no debe contener espacios, números ni caracteres especiales.
hi: अमान्य उपयोक्तानाम - इसमें रिक्त स्थान, संख्याएँ या विशेष वर्ण नहीं होने चाहिए।
ur: غلط صارف نام — اسپیس، نمبر یا خصوصی حروف پر مشتمل نہیں ہونا چاہیے۔

# USERNAME_REQUIRED
source: Username is required
ar: اسم المستخدم مطلوب
es: El nombre de usuario es obligatorio
hi: उपयोगकर्ता नाम आवश्यक है
ur: صارف نام درکار ہے۔

# USERNAME_TOO_LONG
source: Username should not contain more than 18 characters
ar: يجب ألا يحتوي اسم المستخدم على أكثر من 18 حرفًا
es: El nombre de usuario no debe contener más de 18 caracteres.
hi: उपयोगकर्ता नाम में 18 अक्षर से अधिक नहीं होना चाहिए
ur: صارف نام میں 18 حروف سے زیادہ نہیں ہونا چاہیے۔

# USERNAME_TOO_SHORT
source: Username must contain at least 3 characters
ar: يجب أن يحتوي اسم المستخدم على 3 أحرف على الأقل
es: El nombre de usuario debe contener al menos 3 caracteres.
hi: उपयोगकर्ता नाम में कम से कम 3 अक्षर होने चाहिए
ur: صارف کا نام کم از کم 3 حروف پر مشتمل ہونا چاہیے۔

source: Valid
ar: صالح
es: Válida
hi: वैध
ur: درست

source: Valid From
ar: ساري من
es: Válida desde
hi: से मान्य
ur: سے درست ہے۔

source: Validation!
ar: تصديق!
es: ¡Validación!
hi: मान्यता!
ur: توثیق!

# validation_error_title
source: Validation Error
ar: خطأ في التحقق
es: Error de validación
hi: सत्यापन त्रुटि
ur: توثیق کی خرابی۔

source: Validity
ar: صحة
es: Validez
hi: वैधता
ur: موزونیت

# verify_and_proceed
source: Verify & Proceed
ar: تحقق وتابع
es: Verificar y continuar
hi: सत्यापित करें और आगे बढ़ें
ur: تصدیق کریں اور آگے بڑھیں۔

source: Video
ar: فيديو
hi: वीडियो
ur: ویڈیو

# video_progress_reset
source: Video progress has been reset. Watch again to unlock the quiz
ar: تمت إعادة تعيين تقدم الفيديو. شاهد مرة أخرى لفتح الاختبار
es: El progreso del video se ha restablecido. Vuelve a verlo para desbloquear el cuestionario
hi: वीडियो प्रगति रीसेट कर दी गई है। प्रश्नोत्तरी अनलॉक करने के लिए फिर से देखें
ur: ویڈیو کی پیش رفت ری سیٹ کر دی گئی ہے۔ کوئز کھولنے کے لیے دوبارہ دیکھیں

source: View
ar: عرض
es: Vista
hi: देखना
ur: دیکھیں

source: View Details
ar: عرض التفاصيل
es: Ver detalles
hi: विवरण देखें
ur: تفصیلات دیکھیں

source: View Drafts
ar: عرض المسودات
es: Ver Borradores
hi: देखें ड्राफ्ट
ur: دیکھیں ڈرافٹ

source: View Group
ar: عرض المجموعة
es: Ver grupo
hi: समूह देखें
ur: گروپ دیکھیں

source: View Groups
ar: عرض المجموعات
es: Ver Grupos
hi: देखें समूह
ur: دیکھیں گروپس

source: View Justification
ar: عرض المبرر
es: Ver justificación
hi: औचित्य देखें
ur: جواز دیکھیں

source: View Location
ar: عرض الموقع
es: Ver ubicación
hi: स्थान देखें
ur: مقام دیکھیں

source: View Observation
ar: عرض الملاحظة
es: Ver Observación
hi: देखें अवलोकन
ur: دیکھیں مشاہدہ

source: View Observation Closeout
ar: عرض إغلاق الملاحظة
es: Ver cierre de observación
hi: अवलोकन क्लोजआउट देखें
ur: مشاہدہ بند آؤٹ دیکھیں

source: View Observations
ar: عرض الملاحظات
es: Ver observaciones
hi: अवलोकन देखें
ur: مشاہدات دیکھیں

source: View Profile
ar: عرض الملف الشخصي
es: Ver perfil
hi: प्रोफ़ाइल देखें
ur: پروفائل دیکھیں

source: View Project
ar: عرض المشروع
es: Ver proyecto
hi: प्रोजेक्ट देखें
ur: پروجیکٹ دیکھیں

source: View Report
ar: عرض التقرير
es: Ver informe
hi: रिपोर्ट देखें
ur: رپورٹ دیکھیں

source: Violation
ar: انتهاك
es: Violación
hi: उल्लंघन
ur: خلاف ورزی

source: Violation created
ar: تم إنشاء المخالفة
es: Violación creada
hi: उल्लंघन बनाया गया
ur: خلاف ورزی پیدا ہوئی۔

# violation_created_succesfully
source: Violation created successfully
ar: تم إنشاء الانتهاك بنجاح
es: Infracción creada con éxito
hi: उल्लंघन सफलतापूर्वक बनाया गया
ur: خلاف ورزی کامیابی کے ساتھ بنائی گئی۔

source: VIOLATION DATE
ar: تاريخ الانتهاك
es: FECHA DE VIOLACIÓN
hi: उल्लंघन तिथि
ur: خلاف ورزی کی تاریخ

# violation_drafts
source: Violations Drafts
ar: مسودات المخالفات
es: Violaciones Borradores
hi: उल्लंघन ड्राफ्ट
ur: خلاف ورزیوں کے مسودے۔

source: Violation Report
ar: تقرير المخالفة
es: Informe de infracción
hi: उल्लंघन रिपोर्ट
ur: خلاف ورزی کی رپورٹ

# violation_saved_as_draft
source: Violation successfully saved as draft
ar: تم حفظ المخالفة كمسودة بنجاح
es: La infracción se guardó correctamente como borrador
hi: उल्लंघन सफलतापूर्वक ड्राफ्ट के रूप में सहेजा गया
ur: خلاف ورزی کو ڈرافٹ کے طور پر کامیابی سے محفوظ کر لیا گیا۔

# violation_saved_as_draft_without_group_specs
source: Violation successfully saved as draft without group Specifications
ar: تم حفظ المخالفة كمسودة بنجاح بدون مواصفات المجموعة
es: La infracción se guardó correctamente como borrador sin especificaciones de grupo
hi: उल्लंघन को समूह विशिष्टताओं के बिना ड्राफ्ट के रूप में सफलतापूर्वक सहेजा गया
ur: خلاف ورزی کو کامیابی کے ساتھ ڈرافٹ کے طور پر گروپ کی تفصیلات کے بغیر محفوظ کر لیا گیا۔

source: Violations
ar: الانتهاكات
es: Violaciones
hi: उल्लंघन
ur: خلاف ورزیاں

source: Watch Again
ar: شاهد مرة أخرى
es: Ver de nuevo
hi: फिर से देखें
ur: دوبارہ دیکھیں

source: Week
ar: أسبوع
es: Semana
hi: सप्ताह
ur: ہفتہ

source: Weeks
ar: أسابيع
es: Semanas
hi: हफ्तों
ur: ہفتے

# welcome.slide1.description
source: Digitize safety inspections, hazard reporting, and compliance management with an AI-powered platform built for modern site operations.
ar: رقمنة عمليات تفتيش السلامة، والإبلاغ عن المخاطر، وإدارة الامتثال من خلال منصة مدعومة بالذكاء الاصطناعي مخصصة لعمليات الموقع الحديثة.
es: Digitalice las inspecciones de seguridad, el informe de peligros y la gestión del cumplimiento con una plataforma impulsada por IA diseñada para las operaciones modernas del sitio.
hi: आधुनिक साइट संचालन के लिए निर्मित एआई-पावर्ड प्लेटफॉर्म के साथ सुरक्षा निरीक्षण, खतरा रिपोर्टिंग और अनुपालन प्रबंधन को डिजिटाइज़ करें।
ur: جدید سائٹ کے آپریشنز کے لیے بنائے گئے AI سے چلنے والے پلیٹ فارم کے ساتھ حفاظتی معائنے، خطرات کی رپورٹنگ، اور تعمیل کے انتظام کو ڈیجیٹل بنائیں۔

# welcome.slide1.title
source: Welcome to InstaResolv
ar: مرحباً بكم في إنستاريسولف
es: Bienvenido a InstaResolv
hi: InstaResolv में आपका स्वागत है
ur: InstaResolv میں خوش آمدید

# welcome.slide2.description
source: Report issues from the field using photos, voice, or notes while AI helps identify potential safety risks automatically.
ar: الإبلاغ عن المشكلات من الميدان باستخدام الصور أو الصوت أو الملاحظات بينما يساعد الذكاء الاصطناعي في تحديد مخاطر السلامة المحتملة تلقائياً.
es: Informe problemas desde el campo utilizando fotos, voz o notas mientras la IA ayuda a identificar posibles riesgos de seguridad automáticamente.
hi: फ़ोटो, आवाज़ या नोट्स का उपयोग करके फ़ील्ड से समस्याओं की रिपोर्ट करें जबकि एआई संभावित सुरक्षा जोखिमों को स्वचालित रूप से पहचानने में मदद करता है।
ur: تصاویر، آواز، یا نوٹ کا استعمال کرتے ہوئے فیلڈ سے مسائل کی رپورٹ کریں جبکہ AI خود بخود ممکنہ حفاظتی خطرات کی نشاندہی کرنے میں مدد کرتا ہے۔

# welcome.slide2.title
source: Capture & Detect Risks
ar: التقاط واكتشاف المخاطر
es: Capturar y detectar riesgos
hi: जोखिमों को पकड़ें और पहचानें
ur: خطرات کو پکڑیں اور ان کا پتہ لگائیں

# welcome.slide3.description
source: Assign actions, monitor progress, and generate safety reports to maintain compliance across multiple projects and locations.
ar: تعيين الإجراءات ومراقبة التقدم وإنشاء تقارير السلامة للحفاظ على الامتثال عبر مشاريع ومواقع متعددة.
es: Asigne acciones, monitoree el progreso y genere informes de seguridad para mantener el cumplimiento en múltiples proyectos y ubicaciones.
hi: कार्यों को असाइन करें, प्रगति की निगरानी करें और कई प्रोजेक्ट्स और स्थानों पर अनुपालन बनाए रखने के लिए सुरक्षा रिपोर्ट तैयार करें।
ur: متعدد پروجیکٹس اور مقامات پر تعمیل برقرار رکھنے کے لیے اقدامات تفویض کریں، پیش رفت کی نگرانی کریں، اور حفاظتی رپورٹس تیار کریں۔

# welcome.slide3.title
source: Track, Resolve & Stay Compliant
ar: المتابعة والحل والالتزام بالمتطلبات
es: Seguimiento, resolución y cumplimiento
hi: ट्रैक करें, समाधान करें और अनुपालन बनाए रखें
ur: ٹریک کریں، حل کریں اور تعمیل کرتے رہیں

source: Year
ar: سنة
es: Año
hi: वर्ष
ur: سال

source: Years
ar: سنين
es: Años
hi: साल
ur: سال

source: Yes
ar: نعم
es: Sí
hi: हाँ
ur: جی ہاں

source: Yes, Leave
ar: نعم، إرحل
es: Si, vete
hi: हाँ, छोड़ो
ur: ہاں چھوڑو

# you_can_change_language_later
source: You can change the language later from settings
ar: يمكنك تغيير اللغة لاحقا من الإعدادات
es: Puedes cambiar el idioma más tarde desde la configuración
hi: आप बाद में सेटिंग से भाषा बदल सकते हैं
ur: آپ بعد میں ترتیبات سے زبان تبدیل کر سکتے ہیں۔

source: Your Code is
ar: رمزك هو
es: Tu código es
hi: आपका कोड है
ur: آپ کا کوڈ ہے۔

source: Zoondia Pvt Ltd
ar: زونديا الجندي المحدودة
hi: ज़ूंडिया प्राइवेट लिमिटेड
ur: زونڈیا پرائیویٹ لمیٹڈ

source: EMP-%lld
hi: ईएमपी-%lld

# projects.drawer.placeholder_prefix
source: CN
hi: सीएन
ur: سی این
